wosayttn/M55M1BSP/Library/Device/Nuvoton/M55M1/Include/tamper_reg.h
#define TAMPER_TIOCTL_DYNPR1EN_Pos       (23)                                              /*!< TAMPER_T::TIOCTL: DYNPR1EN Position    */
#define TAMPER_TIOCTL_DYNPR1EN_Msk       (0x1ul << TAMPER_TIOCTL_DYNPR1EN_Pos)             /*!< TAMPER_T::TIOCTL: DYNPR1EN Mask        */

#define TAMPER_TIOCTL_TAMP4EN_Pos        (24)                                              /*!< TAMPER_T::TIOCTL: TAMP4EN Position     */
#define TAMPER_TIOCTL_TAMP4EN_Msk        (0x1ul << TAMPER_TIOCTL_TAMP4EN_Pos)              /*!< TAMPER_T::TIOCTL: TAMP4EN Mask         */

#define TAMPER_TIOCTL_TAMP4LV_Pos        (25)                                              /*!< TAMPER_T::TIOCTL: TAMP4LV Position     */
#define TAMPER_TIOCTL_TAMP4LV_Msk        (0x1ul << TAMPER_TIOCTL_TAMP4LV_Pos)              /*!< TAMPER_T::TIOCTL: TAMP4LV Mask         */

#define TAMPER_TIOCTL_TAMP4DBEN_Pos      (26)                                              /*!< TAMPER_T::TIOCTL: TAMP4DBEN Position   */
#define TAMPER_TIOCTL_TAMP4DBEN_Msk      (0x1ul << TAMPER_TIOCTL_TAMP4DBEN_Pos)            /*!< TAMPER_T::TIOCTL: TAMP4DBEN Mask       */

#define TAMPER_TIOCTL_TAMP5EN_Pos        (28)                                              /*!< TAMPER_T::TIOCTL: TAMP5EN Position     */
#define TAMPER_TIOCTL_TAMP5EN_Msk        (0x1ul << TAMPER_TIOCTL_TAMP5EN_Pos)              /*!< TAMPER_T::TIOCTL: TAMP5EN Mask         */

#define TAMPER_TIOCTL_TAMP5LV_Pos        (29)                                              /*!< TAMPER_T::TIOCTL: TAMP5LV Position     */
#define TAMPER_TIOCTL_TAMP5LV_Msk        (0x1ul << TAMPER_TIOCTL_TAMP5LV_Pos)              /*!< TAMPER_T::TIOCTL: TAMP5LV Mask         */

#define TAMPER_TIOCTL_TAMP5DBEN_Pos      (30)                                              /*!< TAMPER_T::TIOCTL: TAMP5DBEN Position   */
#define TAMPER_TIOCTL_TAMP5DBEN_Msk      (0x1ul << TAMPER_TIOCTL_TAMP5DBEN_Pos)            /*!< TAMPER_T::TIOCTL: TAMP5DBEN Mask       */

#define TAMPER_TIOCTL_DYNPR2EN_Pos       (31)                                              /*!< TAMPER_T::TIOCTL: DYNPR2EN Position    */
#define TAMPER_TIOCTL_DYNPR2EN_Msk       (0x1ul << TAMPER_TIOCTL_DYNPR2EN_Pos)             /*!< TAMPER_T::TIOCTL: DYNPR2EN Mask        */

#define TAMPER_SEED_SEED_Pos             (0)                                               /*!< TAMPER_T::SEED: SEED Position          */
#define TAMPER_SEED_SEED_Msk             (0xfffffffful << TAMPER_SEED_SEED_Pos)            /*!< TAMPER_T::SEED: SEED Mask              */

#define TAMPER_SEED2_SEED2_Pos           (0)                                               /*!< TAMPER_T::SEED2: SEED2 Position        */
#define TAMPER_SEED2_SEED2_Msk           (0xfffffffful << TAMPER_SEED2_SEED2_Pos)          /*!< TAMPER_T::SEED2: SEED2 Mask            */

#define TAMPER_ACTSTIOCTL1_ADYN1ISS_Pos  (0)                                               /*!< TAMPER_T::ACTSTIOCTL1: ADYN1ISS Position*/
#define TAMPER_ACTSTIOCTL1_ADYN1ISS_Msk  (0x1ul << TAMPER_ACTSTIOCTL1_ADYN1ISS_Pos)        /*!< TAMPER_T::ACTSTIOCTL1: ADYN1ISS Mask   */

#define TAMPER_ACTSTIOCTL1_ADYNSRC_Pos   (3)                                               /*!< TAMPER_T::ACTSTIOCTL1: ADYNSRC Position*/
#define TAMPER_ACTSTIOCTL1_ADYNSRC_Msk   (0x1ul << TAMPER_ACTSTIOCTL1_ADYNSRC_Pos)         /*!< TAMPER_T::ACTSTIOCTL1: ADYNSRC Mask    */

#define TAMPER_ACTSTIOCTL1_ADYNRATE_Pos  (5)                                               /*!< TAMPER_T::ACTSTIOCTL1: ADYNRATE Position*/
#define TAMPER_ACTSTIOCTL1_ADYNRATE_Msk  (0x7ul << TAMPER_ACTSTIOCTL1_ADYNRATE_Pos)        /*!< TAMPER_T::ACTSTIOCTL1: ADYNRATE Mask   */

#define TAMPER_ACTSTIOCTL1_ATAMP0EN_Pos  (8)                                               /*!< TAMPER_T::ACTSTIOCTL1: ATAMP0EN Position*/
#define TAMPER_ACTSTIOCTL1_ATAMP0EN_Msk  (0x1ul << TAMPER_ACTSTIOCTL1_ATAMP0EN_Pos)        /*!< TAMPER_T::ACTSTIOCTL1: ATAMP0EN Mask   */

#define TAMPER_ACTSTIOCTL1_ATAMP1EN_Pos  (12)                                              /*!< TAMPER_T::ACTSTIOCTL1: ATAMP1EN Position*/
#define TAMPER_ACTSTIOCTL1_ATAMP1EN_Msk  (0x1ul << TAMPER_ACTSTIOCTL1_ATAMP1EN_Pos)        /*!< TAMPER_T::ACTSTIOCTL1: ATAMP1EN Mask   */

#define TAMPER_ACTSTIOCTL1_ADYNPR0EN_Pos (15)                                              /*!< TAMPER_T::ACTSTIOCTL1: ADYNPR0EN Position*/
#define TAMPER_ACTSTIOCTL1_ADYNPR0EN_Msk (0x1ul << TAMPER_ACTSTIOCTL1_ADYNPR0EN_Pos)       /*!< TAMPER_T::ACTSTIOCTL1: ADYNPR0EN Mask  */

#define TAMPER_ACTSTIOCTL1_ATAMP2EN_Pos  (16)                                              /*!< TAMPER_T::ACTSTIOCTL1: ATAMP2EN Position*/
#define TAMPER_ACTSTIOCTL1_ATAMP2EN_Msk  (0x1ul << TAMPER_ACTSTIOCTL1_ATAMP2EN_Pos)        /*!< TAMPER_T::ACTSTIOCTL1: ATAMP2EN Mask   */

#define TAMPER_ACTSTIOCTL1_ATAMP3EN_Pos  (20)                                              /*!< TAMPER_T::ACTSTIOCTL1: ATAMP3EN Position*/
#define TAMPER_ACTSTIOCTL1_ATAMP3EN_Msk  (0x1ul << TAMPER_ACTSTIOCTL1_ATAMP3EN_Pos)        /*!< TAMPER_T::ACTSTIOCTL1: ATAMP3EN Mask   */

#define TAMPER_ACTSTIOCTL1_ADYNPR1EN_Pos (23)                                              /*!< TAMPER_T::ACTSTIOCTL1: ADYNPR1EN Position*/
#define TAMPER_ACTSTIOCTL1_ADYNPR1EN_Msk (0x1ul << TAMPER_ACTSTIOCTL1_ADYNPR1EN_Pos)       /*!< TAMPER_T::ACTSTIOCTL1: ADYNPR1EN Mask  */

#define TAMPER_ACTSTIOCTL1_ATAMP4EN_Pos  (24)                                              /*!< TAMPER_T::ACTSTIOCTL1: ATAMP4EN Position*/
#define TAMPER_ACTSTIOCTL1_ATAMP4EN_Msk  (0x1ul << TAMPER_ACTSTIOCTL1_ATAMP4EN_Pos)        /*!< TAMPER_T::ACTSTIOCTL1: ATAMP4EN Mask   */

#define TAMPER_ACTSTIOCTL1_ATAMP5EN_Pos  (28)                                              /*!< TAMPER_T::ACTSTIOCTL1: ATAMP5EN Position*/
#define TAMPER_ACTSTIOCTL1_ATAMP5EN_Msk  (0x1ul << TAMPER_ACTSTIOCTL1_ATAMP5EN_Pos)        /*!< TAMPER_T::ACTSTIOCTL1: ATAMP5EN Mask   */

#define TAMPER_ACTSTIOCTL1_ADYNPR2EN_Pos (31)                                              /*!< TAMPER_T::ACTSTIOCTL1: ADYNPR2EN Position*/
#define TAMPER_ACTSTIOCTL1_ADYNPR2EN_Msk (0x1ul << TAMPER_ACTSTIOCTL1_ADYNPR2EN_Pos)       /*!< TAMPER_T::ACTSTIOCTL1: ADYNPR2EN Mask  */

#define TAMPER_ACTSTIOCTL2_ADYN1ISS2_Pos (0)                                               /*!< TAMPER_T::ACTSTIOCTL2: ADYN1ISS2 Position*/
#define TAMPER_ACTSTIOCTL2_ADYN1ISS2_Msk (0x1ul << TAMPER_ACTSTIOCTL2_ADYN1ISS2_Pos)       /*!< TAMPER_T::ACTSTIOCTL2: ADYN1ISS2 Mask  */

#define TAMPER_ACTSTIOCTL2_ADYNSRC2_Pos  (3)                                               /*!< TAMPER_T::ACTSTIOCTL2: ADYNSRC2 Position*/
#define TAMPER_ACTSTIOCTL2_ADYNSRC2_Msk  (0x1ul << TAMPER_ACTSTIOCTL2_ADYNSRC2_Pos)        /*!< TAMPER_T::ACTSTIOCTL2: ADYNSRC2 Mask   */

#define TAMPER_ACTSTIOCTL2_SEEDRLD2_Pos  (4)                                               /*!< TAMPER_T::ACTSTIOCTL2: SEEDRLD2 Position*/
#define TAMPER_ACTSTIOCTL2_SEEDRLD2_Msk  (0x1ul << TAMPER_ACTSTIOCTL2_SEEDRLD2_Pos)        /*!< TAMPER_T::ACTSTIOCTL2: SEEDRLD2 Mask   */

