wosayttn/M55M1BSP/Library/Device/Nuvoton/M55M1/Include/tamper_reg.h
#define TAMPER_ACTSTIOCTL2_ADYNRATE2_Pos (5)                                               /*!< TAMPER_T::ACTSTIOCTL2: ADYNRATE2 Position*/
#define TAMPER_ACTSTIOCTL2_ADYNRATE2_Msk (0x7ul << TAMPER_ACTSTIOCTL2_ADYNRATE2_Pos)       /*!< TAMPER_T::ACTSTIOCTL2: ADYNRATE2 Mask  */

#define TAMPER_ACTSTIOCTL2_ATAMP0EN2_Pos (8)                                               /*!< TAMPER_T::ACTSTIOCTL2: ATAMP0EN2 Position*/
#define TAMPER_ACTSTIOCTL2_ATAMP0EN2_Msk (0x1ul << TAMPER_ACTSTIOCTL2_ATAMP0EN2_Pos)       /*!< TAMPER_T::ACTSTIOCTL2: ATAMP0EN2 Mask  */

#define TAMPER_ACTSTIOCTL2_ATAMP1EN2_Pos (12)                                              /*!< TAMPER_T::ACTSTIOCTL2: ATAMP1EN2 Position*/
#define TAMPER_ACTSTIOCTL2_ATAMP1EN2_Msk (0x1ul << TAMPER_ACTSTIOCTL2_ATAMP1EN2_Pos)       /*!< TAMPER_T::ACTSTIOCTL2: ATAMP1EN2 Mask  */

#define TAMPER_ACTSTIOCTL2_ADYNPR0EN2_Pos (15)                                             /*!< TAMPER_T::ACTSTIOCTL2: ADYNPR0EN2 Position*/
#define TAMPER_ACTSTIOCTL2_ADYNPR0EN2_Msk (0x1ul << TAMPER_ACTSTIOCTL2_ADYNPR0EN2_Pos)     /*!< TAMPER_T::ACTSTIOCTL2: ADYNPR0EN2 Mask */

#define TAMPER_ACTSTIOCTL2_ATAMP2EN2_Pos (16)                                              /*!< TAMPER_T::ACTSTIOCTL2: ATAMP2EN2 Position*/
#define TAMPER_ACTSTIOCTL2_ATAMP2EN2_Msk (0x1ul << TAMPER_ACTSTIOCTL2_ATAMP2EN2_Pos)       /*!< TAMPER_T::ACTSTIOCTL2: ATAMP2EN2 Mask  */

#define TAMPER_ACTSTIOCTL2_ATAMP3EN2_Pos (20)                                              /*!< TAMPER_T::ACTSTIOCTL2: ATAMP3EN2 Position*/
#define TAMPER_ACTSTIOCTL2_ATAMP3EN2_Msk (0x1ul << TAMPER_ACTSTIOCTL2_ATAMP3EN2_Pos)       /*!< TAMPER_T::ACTSTIOCTL2: ATAMP3EN2 Mask  */

#define TAMPER_ACTSTIOCTL2_ADYNPR1EN2_Pos (23)                                             /*!< TAMPER_T::ACTSTIOCTL2: ADYNPR1EN2 Position*/
#define TAMPER_ACTSTIOCTL2_ADYNPR1EN2_Msk (0x1ul << TAMPER_ACTSTIOCTL2_ADYNPR1EN2_Pos)     /*!< TAMPER_T::ACTSTIOCTL2: ADYNPR1EN2 Mask */

#define TAMPER_ACTSTIOCTL2_ATAMP4EN2_Pos (24)                                              /*!< TAMPER_T::ACTSTIOCTL2: ATAMP4EN2 Position*/
#define TAMPER_ACTSTIOCTL2_ATAMP4EN2_Msk (0x1ul << TAMPER_ACTSTIOCTL2_ATAMP4EN2_Pos)       /*!< TAMPER_T::ACTSTIOCTL2: ATAMP4EN2 Mask  */

#define TAMPER_ACTSTIOCTL2_ATAMP5EN2_Pos (28)                                              /*!< TAMPER_T::ACTSTIOCTL2: ATAMP5EN2 Position*/
#define TAMPER_ACTSTIOCTL2_ATAMP5EN2_Msk (0x1ul << TAMPER_ACTSTIOCTL2_ATAMP5EN2_Pos)       /*!< TAMPER_T::ACTSTIOCTL2: ATAMP5EN2 Mask  */

#define TAMPER_ACTSTIOCTL2_ADYNPR2EN2_Pos (31)                                             /*!< TAMPER_T::ACTSTIOCTL2: ADYNPR2EN2 Position*/
#define TAMPER_ACTSTIOCTL2_ADYNPR2EN2_Msk (0x1ul << TAMPER_ACTSTIOCTL2_ADYNPR2EN2_Pos)     /*!< TAMPER_T::ACTSTIOCTL2: ADYNPR2EN2 Mask */

#define TAMPER_CDBR_STOPBD_Pos           (0)                                               /*!< TAMPER_T::CDBR: STOPBD Position        */
#define TAMPER_CDBR_STOPBD_Msk           (0xfful << TAMPER_CDBR_STOPBD_Pos)                /*!< TAMPER_T::CDBR: STOPBD Mask            */

#define TAMPER_CDBR_FAILBD_Pos           (16)                                              /*!< TAMPER_T::CDBR: FAILBD Position        */
#define TAMPER_CDBR_FAILBD_Msk           (0xfful << TAMPER_CDBR_FAILBD_Pos)                /*!< TAMPER_T::CDBR: FAILBD Mask            */

#define TAMPER_VG_PCLKSEL0_Pos           (0)                                               /*!< TAMPER_T::VG: PCLKSEL0 Position        */
#define TAMPER_VG_PCLKSEL0_Msk           (0xful << TAMPER_VG_PCLKSEL0_Pos)                 /*!< TAMPER_T::VG: PCLKSEL0 Mask            */

#define TAMPER_VG_NCLKSEL0_Pos           (4)                                               /*!< TAMPER_T::VG: NCLKSEL0 Position        */
#define TAMPER_VG_NCLKSEL0_Msk           (0xful << TAMPER_VG_NCLKSEL0_Pos)                 /*!< TAMPER_T::VG: NCLKSEL0 Mask            */

#define TAMPER_VG_PDATSEL0_Pos           (8)                                               /*!< TAMPER_T::VG: PDATSEL0 Position        */
#define TAMPER_VG_PDATSEL0_Msk           (0xful << TAMPER_VG_PDATSEL0_Pos)                 /*!< TAMPER_T::VG: PDATSEL0 Mask            */

#define TAMPER_VG_NDATSEL0_Pos           (12)                                              /*!< TAMPER_T::VG: NDATSEL0 Position        */
#define TAMPER_VG_NDATSEL0_Msk           (0xful << TAMPER_VG_NDATSEL0_Pos)                 /*!< TAMPER_T::VG: NDATSEL0 Mask            */

#define TAMPER_VG_PCLKSEL1_Pos           (16)                                              /*!< TAMPER_T::VG: PCLKSEL1 Position        */
#define TAMPER_VG_PCLKSEL1_Msk           (0xful << TAMPER_VG_PCLKSEL1_Pos)                 /*!< TAMPER_T::VG: PCLKSEL1 Mask            */

#define TAMPER_VG_NCLKSEL1_Pos           (20)                                              /*!< TAMPER_T::VG: NCLKSEL1 Position        */
#define TAMPER_VG_NCLKSEL1_Msk           (0xful << TAMPER_VG_NCLKSEL1_Pos)                 /*!< TAMPER_T::VG: NCLKSEL1 Mask            */

#define TAMPER_VG_PDATSEL1_Pos           (24)                                              /*!< TAMPER_T::VG: PDATSEL1 Position        */
#define TAMPER_VG_PDATSEL1_Msk           (0xful << TAMPER_VG_PDATSEL1_Pos)                 /*!< TAMPER_T::VG: PDATSEL1 Mask            */

#define TAMPER_VG_NDATSEL1_Pos           (28)                                              /*!< TAMPER_T::VG: NDATSEL1 Position        */
#define TAMPER_VG_NDATSEL1_Msk           (0xful << TAMPER_VG_NDATSEL1_Pos)                 /*!< TAMPER_T::VG: NDATSEL1 Mask            */

#define TAMPER_VGEV_VGECNTP_Pos          (0)                                               /*!< TAMPER_T::VGEV: VGECNTP Position       */
#define TAMPER_VGEV_VGECNTP_Msk          (0xfful << TAMPER_VGEV_VGECNTP_Pos)               /*!< TAMPER_T::VGEV: VGECNTP Mask           */

#define TAMPER_VGEV_VGECNTN_Pos          (8)                                               /*!< TAMPER_T::VGEV: VGECNTN Position       */
#define TAMPER_VGEV_VGECNTN_Msk          (0xfful << TAMPER_VGEV_VGECNTN_Pos)               /*!< TAMPER_T::VGEV: VGECNTN Mask           */

#define TAMPER_LDOTRIM_TLDOTRIM_Pos      (0)                                               /*!< TAMPER_T::LDOTRIM: TLDOTRIM Position   */
#define TAMPER_LDOTRIM_TLDOTRIM_Msk      (0xful << TAMPER_LDOTRIM_TLDOTRIM_Pos)            /*!< TAMPER_T::LDOTRIM: TLDOTRIM Mask       */

#define TAMPER_LDOTRIM_TLDOIQSEL_Pos     (8)                                               /*!< TAMPER_T::LDOTRIM: TLDOIQSEL Position  */
#define TAMPER_LDOTRIM_TLDOIQSEL_Msk     (0x3ul << TAMPER_LDOTRIM_TLDOIQSEL_Pos)           /*!< TAMPER_T::LDOTRIM: TLDOIQSEL Mask      */

#define TAMPER_LBSTRIM_TLVDSEL_Pos       (0)                                               /*!< TAMPER_T::LBSTRIM: TLVDSEL Position    */
#define TAMPER_LBSTRIM_TLVDSEL_Msk       (0x7ul << TAMPER_LBSTRIM_TLVDSEL_Pos)             /*!< TAMPER_T::LBSTRIM: TLVDSEL Mask        */

#define TAMPER_LBSTRIM_TOVDSEL_Pos       (4)                                               /*!< TAMPER_T::LBSTRIM: TOVDSEL Position    */
#define TAMPER_LBSTRIM_TOVDSEL_Msk       (0x1ul << TAMPER_LBSTRIM_TOVDSEL_Pos)             /*!< TAMPER_T::LBSTRIM: TOVDSEL Mask        */

